/*******************************************************************/
/* TX-1Cµ¥Æ¬»úÊµÑé°åÊµÑéÀı³Ì        							   */
/* 2007Äê8ÔÂµÚ¶şÆÚÅàÑµ°à¿ÎºóÏ°ÌâÏê½â							   */
/* ×÷Õß£º¹ùÌìÏé      											   */
/* ÓÊÏä£ºtxmcu@163.com 										  	   */
/* ÍøÕ¾£ºwww.txmcu.com(ÌìÏéµç×Ó)    							   */
/*¡¾°æÈ¨¡¿Copyright(C)ÌìÏéµç×Ó www.txmcu.com  All Rights Reserved  */
/*¡¾ÉùÃ÷¡¿´Ë³ÌĞò½öÓÃÓÚÑ§Ï°Óë²Î¿¼£¬ÒıÓÃÇë×¢Ã÷°æÈ¨ºÍ×÷ÕßĞÅÏ¢£¡       */
/*                                                                 */
/*******************************************************************/
/*                                                          
ÀûÓÃ¶¨Ê±/¼ÆÊıÆ÷T0´ÓP1.0Êä³öÖÜÆÚÎª1sµÄ·½²¨£¬
ÈÃ·¢¹â¶ş¼«¹ÜÒÔ1HZÉÁË¸£¬
Éè¾§ÕñÆµÂÊÎª12MHz¡££
*/
/*********************************************************/
#include<reg52.h>  //52µ¥Æ¬»úÍ·ÎÄ¼ş
#include <intrins.h> //°üº¬ÓĞ×óÓÒÑ­»·ÒÆÎ»×Óº¯ÊıµÄ¿â
#define uint unsigned int    //ºê¶¨Òå
#define uchar unsigned char  //ºê¶¨Òå
sbit P1_0=P1^0;
uchar tt;
void main()		    //Ö÷º¯Êı
{
	TMOD=0x01;//ÉèÖÃ¶¨Ê±Æ÷0Îª¹¤×÷·½Ê½1
	TH0=(65536-50000)/256;
	TL0=(65536-50000)%256;
	EA=1;//¿ª×ÜÖĞ¶Ï
	ET0=1;//¿ª¶¨Ê±Æ÷0ÖĞ¶Ï
	TR0=1;//Æô¶¯¶¨Ê±Æ÷0
	while(1);//µÈ´ıÖĞ¶Ï²úÉú
	
}

void timer0() interrupt 1
{
	TH0=(65536-50000)/256;
	TL0=(65536-50000)%256;
	tt++;
	if(tt==20)
	{
		tt=0;
		P1_0=~P1_0;
	}
}