/*******************************************************************/
/* TX-1Cµ¥Æ¬»úÊµÑé°åÊµÑéÀı³Ì        							   */
/* 2007Äê8ÔÂµÚ¶şÆÚÅàÑµ°à¿ÎºóÏ°ÌâÏê½â							   */
/* ×÷Õß£º¹ùÌìÏé      											   */
/* ÓÊÏä£ºtxmcu@163.com 										  	   */
/* ÍøÕ¾£ºwww.txmcu.com(ÌìÏéµç×Ó)    							   */
/*¡¾°æÈ¨¡¿Copyright(C)ÌìÏéµç×Ó www.txmcu.com  All Rights Reserved  */
/*¡¾ÉùÃ÷¡¿´Ë³ÌĞò½öÓÃÓÚÑ§Ï°Óë²Î¿¼£¬ÒıÓÃÇë×¢Ã÷°æÈ¨ºÍ×÷ÕßĞÅÏ¢£¡       */
/*                                                                 */
/*******************************************************************/
/*                                                          
Í¬Ê±ÓÃÁ½¸ö¶¨Ê±Æ÷¿ØÖÆ·äÃùÆ÷·¢Éù£¬
¶¨Ê±Æ÷0¿ØÖÆÆµÂÊ£¬¶¨Ê±Æ÷1¿ØÖÆÍ¬¸ö
ÆµÂÊ³ÖĞøµÄÊ±¼ä£¬¼ä¸ô2sÒÀ´ÎÊä³ö
1£¬10£¬50,100£¬200,400,800,
1k£¨hz£©µÄ·½²¨£
Éè¾§ÕñÆµÂÊÎª12MHz¡£
*/
/*********************************************************/
#include<reg52.h>  //52µ¥Æ¬»úÍ·ÎÄ¼ş
#include <intrins.h> //°üº¬ÓĞ×óÓÒÑ­»·ÒÆÎ»×Óº¯ÊıµÄ¿â
#define uint unsigned int    //ºê¶¨Òå
#define uchar unsigned char  //ºê¶¨Òå
sbit beep=P2^3;
uchar tt;
uint fre,flag;

void main()		    //Ö÷º¯Êı
{
	fre=50000;
	beep=0;
	TMOD=0x11;//ÉèÖÃ¶¨Ê±Æ÷0,¶¨Ê±Æ÷1Îª¹¤×÷·½Ê½1
	TH0=(65536-fre)/256;
	TL0=(65536-fre)%256;
	TH1=(65536-50000)/256;
	TL1=(65536-50000)%256;
	EA=1;//¿ª×ÜÖĞ¶Ï
	ET0=1;//¿ª¶¨Ê±Æ÷0ÖĞ¶Ï
	ET1=1;
	TR1=1;
	TR0=1;//Æô¶¯¶¨Ê±Æ÷0
	while(1);//µÈ´ıÖĞ¶Ï²úÉú
	
}

void timer0() interrupt 1   //¶¨Ê±Æ÷0ÖĞ¶Ï
{
	TR0=0;    //½øÖĞ¶ÏºóÏÈ°Ñ¶¨Ê±Æ÷0ÖĞ¶Ï¹Ø±Õ£¬·ÀÖ¹ÄÚ²¿³ÌĞò¹ı¶à¶øÔì³ÉÖĞ¶Ï¶ªÊ§
	TH0=(65536-fre)/256;
	TL0=(65536-fre)%256;
	tt++;
	if(flag<40)    //ÒÔÏÂ¼¸¸öif·Ö±ğÓÃÀ´Ñ¡È¡²»Í¬µÄÆµÂÊ
		if(tt==10)
			{
				tt=0;
				fre=50000;
				beep=~beep;
			}
	if(flag>=40&&flag<80)
		{
			tt=0;
			fre=50000;
			beep=~beep;	
		}
	if(flag>=80&&flag<120)
		{
			tt=0;
			fre=10000;
			beep=~beep;	
		}
	if(flag>=120&&flag<160)
		{
			tt=0;
			fre=5000;
			beep=~beep;	
		}
	if(flag>=160&&flag<200)
		{
			tt=0;
			fre=2500;
			beep=~beep;	
		}
	if(flag>=200&&flag<240)
		{
			tt=0;
			fre=1250;
			beep=~beep;	
		}
	if(flag>=240&&flag<280)
		{
			tt=0;
			fre=625;
			beep=~beep;	
		}
	if(flag>=280&&flag<320)
		{
			tt=0;
			fre=312;
			beep=~beep;	
		}
	if(flag>=320&&flag<360)
		{
			tt=0;
			fre=156;
			beep=~beep;	
		}
	TR0=1;
}
void timer1() interrupt 3  //¶¨Ê±Æ÷1ÖĞ¶ÏÓÃÀ´²úÉú2ÃëÊ±¼ä¶¨Ê±
{
	TH1=(65536-50000)/256;
	TL1=(65536-50000)%256;
	flag++;
	if(flag==360)
	  {
	    flag=0;
	    fre=50000;
	  }
}
